84_7ms_Mesh2/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          160;
        startFace       338460;
    }
    outlet
    {
        type            patch;
        nFaces          160;
        startFace       338620;
    }
    lowerWall
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          260;
        startFace       338780;
    }
    upperWall
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          260;
        startFace       339040;
    }
    pipe
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          640;
        startFace       339300;
    }
    defaultFaces
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          339200;
        startFace       339940;
    }
)

// ************************************************************************* //
